stagemonitor-tracing/src/test/resources/wsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema"
				  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
				  xmlns:tns="http://www.jboss.org/jbossas/quickstarts/wshelloworld/HelloWorld"
				  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http"
				  name="HelloWorldService" targetNamespace="http://www.jboss.org/jbossas/quickstarts/wshelloworld/HelloWorld">
	<wsdl:types>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema"
				   xmlns:tns="http://www.jboss.org/jbossas/quickstarts/wshelloworld/HelloWorld"
				   targetNamespace="http://www.jboss.org/jbossas/quickstarts/wshelloworld/HelloWorld" version="1.0">

			<xs:element name="sayHello" type="tns:sayHello"/>

			<xs:element name="sayHelloResponse" type="tns:sayHelloResponse"/>


			<xs:complexType name="sayHello">
				<xs:sequence/>
			</xs:complexType>

			<xs:complexType name="sayHelloResponse">
				<xs:sequence>
					<xs:element minOccurs="0" name="return" type="xs:string"/>
				</xs:sequence>
			</xs:complexType>

		</xs:schema>
	</wsdl:types>
	<wsdl:message name="sayHelloResponse">
		<wsdl:part element="tns:sayHelloResponse" name="parameters">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="sayHello">
		<wsdl:part element="tns:sayHello" name="parameters">
		</wsdl:part>
	</wsdl:message>
	<wsdl:portType name="HelloWorldService">
		<wsdl:operation name="sayHello">
			<wsdl:input message="tns:sayHello" name="sayHello">
			</wsdl:input>
			<wsdl:output message="tns:sayHelloResponse" name="sayHelloResponse">
			</wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="HelloWorldServiceSoapBinding" type="tns:HelloWorldService">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="sayHello">
			<soap:operation soapAction="" style="document"/>
			<wsdl:input name="sayHello">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="sayHelloResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="HelloWorldService">
		<wsdl:port binding="tns:HelloWorldServiceSoapBinding" name="HelloWorld">
			<soap:address location="http://localhost:8080/jboss-helloworld-ws/HelloWorldService"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
